import math
print('''Условия задачи 3: 
 Написать функцию, которая отвечает на вопрос, пересекаются ли две заданные окружности на плоскости. Каждая окружность задается координатами центра и радиусом.
def circles_intersect(x1, y1, r1, x2, y2, r2): # returns boolean value